@extends("layouts.app")
@section("title", "Калькуляторы")
@section("description", "Описание Калькулятора")

@section("content")
    <input type="hidden" id="resCalcul" name="resCalcul" value="{{ $data }}">
    <section class="calculator">
        <div class="container">
            <div class="calculator__wrap">
                <div>
                    <div class="calculator__block">
                        <div class="calculator__container"></div>
                    </div>

                    <div class="calculator__footer">
                        <ul>
                            <li>
                                <dialog id="modalError">
                                    <h3>СООБЩИТЬ ОБ ОШИБКЕ / ПРЕДЛОЖИТЬ ИДЕЮ</h3>
                                    <form id="formModal" method="POST" enctype="multipart/form-data">
                                        <input type="email" id="email" name="email" placeholder="Ваш E-mail">
                                        <textarea name="error-message"
                                                  placeholder="Опишите ошибку или предложите идею"></textarea>
                                        <label class="input-file">
                                            <input type="file" name="file">
                                            <span class="input-file-btn">Выберите файл</span>
                                            <span class="input-file-text">Максимум 10мб</span>
                                        </label>

                                        <button type="submit">Отправить</button>
                                    </form>
                                    <button class="btn-modal-close">
                                           <i class="fa-regular fa-circle-xmark"></i>
                                    </button>
                                </dialog>
                                <button class="btn-modal" id="modalError">
                                    <i class="fa-solid fa-bug"></i>
                                    <span>Сообщить об ошибке</span>
                                </button>
                            </li>
                            <li>
                                <button id="favourites">
                                     <i class="fa-regular fa-star"></i>
                                    <span>В избранное</span>
                                </button>
                            </li>
                            <li>
                                <dialog id="modalWidget">
                                    <h3>Код виджета</h3>
                                    <h4>Код виджета состоит из двух частей:</h4>
                                    <ol>
                                        <li>
                                            <p>Подключение библиотеки. Поместите этот код между тегами
                                                <head> и</head>
                                                вашего сайта.
                                            </p>
                                            <p class="code">
                                                <code>&lt;script src="https://calcus.ru/dist/widget.js"&gt;&lt;/script&gt;</code>
                                            </p>
                                        </li>
                                        <li>
                                            <p>Инициализация виджета. Поместите этот код в то место, где должен
                                                располагаться виджет калькулятора.</p>
                                            <p class="code">
                                                <code>
                                                    &lt;div class="calculator__container"&gt;&lt;/div&gt;
                                                    <br>
                                                    <br>
                                                    &lt;script&gt;
                                                    <br>
                                                    Widget.render("Brok");
                                                    <br>
                                                    &lt;/script&gt;
                                                </code>
                                            </p>
                                        </li>
                                    </ol>
                                    <p class="warning">Допускается размещение не более 1 виджета на одну страницу
                                        сайта.</p>
                                    <button class="btn-modal-close">
                                       <i class="fa-regular fa-circle-xmark"></i>
                                    </button>
                                </dialog>
                                <button class="btn-modal" id="modalError">
                                    <i class="fa-regular fa-window-restore"></i>
                                    <span>Виджет</span>
                                </button>
                            </li>
                            <li>
                                <dialog id="modalShare">
                                    <h3>Поделиться</h3>
                                    <ul>
                                        <li>
                                            <a href="http://www.facebook.com/sharer.php?u=<your url>" target="_blank">
                                                <svg width="48px" height="48px" xmlns="http://www.w3.org/2000/svg"
                                                     viewBox="0 0 512 512">
                                                    <path fill="#3B5998"
                                                          d="M512 256C512 114.6 397.4 0 256 0S0 114.6 0 256C0 376 82.7 476.8 194.2 504.5V334.2H141.4V256h52.8V222.3c0-87.1 39.4-127.5 125-127.5c16.2 0 44.2 3.2 55.7 6.4V172c-6-.6-16.5-1-29.6-1c-42 0-58.2 15.9-58.2 57.2V256h83.6l-14.4 78.2H287V510.1C413.8 494.8 512 386.9 512 256h0z"/>
                                                </svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="https://twitter.com/share?url=" target="_blank">
                                                <svg width="48px" height="48px" fill="#49A9E2"
                                                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                                    <path
                                                        d="M64 32C28.7 32 0 60.7 0 96V416c0 35.3 28.7 64 64 64H384c35.3 0 64-28.7 64-64V96c0-35.3-28.7-64-64-64H64zM351.3 199.3v0c0 86.7-66 186.6-186.6 186.6c-37.2 0-71.7-10.8-100.7-29.4c5.3 .6 10.4 .8 15.8 .8c30.7 0 58.9-10.4 81.4-28c-28.8-.6-53-19.5-61.3-45.5c10.1 1.5 19.2 1.5 29.6-1.2c-30-6.1-52.5-32.5-52.5-64.4v-.8c8.7 4.9 18.9 7.9 29.6 8.3c-9-6-16.4-14.1-21.5-23.6s-7.8-20.2-7.7-31c0-12.2 3.2-23.4 8.9-33.1c32.3 39.8 80.8 65.8 135.2 68.6c-9.3-44.5 24-80.6 64-80.6c18.9 0 35.9 7.9 47.9 20.7c14.8-2.8 29-8.3 41.6-15.8c-4.9 15.2-15.2 28-28.8 36.1c13.2-1.4 26-5.1 37.8-10.2c-8.9 13.1-20.1 24.7-32.9 34c.2 2.8 .2 5.7 .2 8.5z"/>
                                                </svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="http://vk.com/share.php?url=" target="_blank">
                                                <svg width="48px" height="48px" fill="#48729E"
                                                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                                    <path
                                                        d="M31.5 63.5C0 95 0 145.7 0 247V265C0 366.3 0 417 31.5 448.5C63 480 113.7 480 215 480H233C334.3 480 385 480 416.5 448.5C448 417 448 366.3 448 265V247C448 145.7 448 95 416.5 63.5C385 32 334.3 32 233 32H215C113.7 32 63 32 31.5 63.5zM75.6 168.3H126.7C128.4 253.8 166.1 290 196 297.4V168.3H244.2V242C273.7 238.8 304.6 205.2 315.1 168.3H363.3C359.3 187.4 351.5 205.6 340.2 221.6C328.9 237.6 314.5 251.1 297.7 261.2C316.4 270.5 332.9 283.6 346.1 299.8C359.4 315.9 369 334.6 374.5 354.7H321.4C316.6 337.3 306.6 321.6 292.9 309.8C279.1 297.9 262.2 290.4 244.2 288.1V354.7H238.4C136.3 354.7 78 284.7 75.6 168.3z"/>
                                                </svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="https://connect.ok.ru/offer?url=" target="_blank">
                                                <svg height="48px" version="1.1" viewBox="0 0 512 512" width="48px"
                                                     xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                                                     xmlns:xlink="http://www.w3.org/1999/xlink"><g
                                                        id="_x35_9-odnoklassniki">
                                                        <g>
                                                            <g>
                                                                <g>
                                                                    <path
                                                                        d="M256,255.996c65.789,0,119.301-53.648,119.301-119.627C375.301,70.397,321.789,16.75,256,16.75      c-65.793,0-119.302,53.647-119.302,119.619C136.698,202.348,190.207,255.996,256,255.996L256,255.996z M256,76.557      c32.896,0,59.648,26.827,59.648,59.812c0,32.986-26.752,59.816-59.648,59.816c-32.898,0-59.654-26.83-59.654-59.816      C196.346,103.384,223.102,76.557,256,76.557L256,76.557z M256,76.557"
                                                                        style="fill:#FFC107;"/>
                                                                    <path
                                                                        d="M414.193,252.676c-11.662-11.696-30.516-11.696-42.174,0      c-63.945,64.116-168.037,64.116-232.011,0c-11.658-11.696-30.512-11.696-42.174,0c-11.662,11.69-11.662,30.596,0,42.319      c37.102,37.199,84.134,58.407,132.632,63.932l-85.031,85.265c-11.658,11.694-11.658,30.592,0,42.286      c11.664,11.696,30.51,11.696,42.173,0L256,417.906l68.391,68.571c5.818,5.832,13.447,8.769,21.084,8.769      s15.268-2.937,21.084-8.769c11.662-11.694,11.662-30.592,0-42.286l-85.031-85.265c48.496-5.524,95.531-26.732,132.633-63.932      C425.824,283.295,425.824,264.366,414.193,252.676L414.193,252.676z M414.193,252.676"
                                                                        style="fill:#FFC107;"/>
                                                                </g>
                                                            </g>
                                                        </g>
                                                    </g>
                                                    <g id="Layer_1"/></svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="tg://msg_url?url=" target="_blank">
                                                <svg fill="#3390EC" width="48px" height="48px"
                                                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512">
                                                    <path
                                                        d="M248 8C111 8 0 119 0 256S111 504 248 504 496 393 496 256 385 8 248 8zM363 176.7c-3.7 39.2-19.9 134.4-28.1 178.3-3.5 18.6-10.3 24.8-16.9 25.4-14.4 1.3-25.3-9.5-39.3-18.7-21.8-14.3-34.2-23.2-55.3-37.2-24.5-16.1-8.6-25 5.3-39.5 3.7-3.8 67.1-61.5 68.3-66.7 .2-.7 .3-3.1-1.2-4.4s-3.6-.8-5.1-.5q-3.3 .7-104.6 69.1-14.8 10.2-26.9 9.9c-8.9-.2-25.9-5-38.6-9.1-15.5-5-27.9-7.7-26.8-16.3q.8-6.7 18.5-13.7 108.4-47.2 144.6-62.3c68.9-28.6 83.2-33.6 92.5-33.8 2.1 0 6.6 .5 9.6 2.9a10.5 10.5 0 0 1 3.5 6.7A43.8 43.8 0 0 1 363 176.7z"/>
                                                </svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="https://wa.me/?text=" target="_blank">
                                                <svg fill="#3AD775" width="48px" height="48px"
                                                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                                    <path
                                                        d="M380.9 97.1C339 55.1 283.2 32 223.9 32c-122.4 0-222 99.6-222 222 0 39.1 10.2 77.3 29.6 111L0 480l117.7-30.9c32.4 17.7 68.9 27 106.1 27h.1c122.3 0 224.1-99.6 224.1-222 0-59.3-25.2-115-67.1-157zm-157 341.6c-33.2 0-65.7-8.9-94-25.7l-6.7-4-69.8 18.3L72 359.2l-4.4-7c-18.5-29.4-28.2-63.3-28.2-98.2 0-101.7 82.8-184.5 184.6-184.5 49.3 0 95.6 19.2 130.4 54.1 34.8 34.9 56.2 81.2 56.1 130.5 0 101.8-84.9 184.6-186.6 184.6zm101.2-138.2c-5.5-2.8-32.8-16.2-37.9-18-5.1-1.9-8.8-2.8-12.5 2.8-3.7 5.6-14.3 18-17.6 21.8-3.2 3.7-6.5 4.2-12 1.4-32.6-16.3-54-29.1-75.5-66-5.7-9.8 5.7-9.1 16.3-30.3 1.8-3.7 .9-6.9-.5-9.7-1.4-2.8-12.5-30.1-17.1-41.2-4.5-10.8-9.1-9.3-12.5-9.5-3.2-.2-6.9-.2-10.6-.2-3.7 0-9.7 1.4-14.8 6.9-5.1 5.6-19.4 19-19.4 46.3 0 27.3 19.9 53.7 22.6 57.4 2.8 3.7 39.1 59.7 94.8 83.8 35.2 15.2 49 16.5 66.6 13.9 10.7-1.6 32.8-13.4 37.4-26.4 4.6-13 4.6-24.1 3.2-26.4-1.3-2.5-5-3.9-10.5-6.6z"/>
                                                </svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="viber://forward?text=" target="_blank">
                                                <svg width="48px" height="48px" fill="#583EB5"
                                                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
                                                    <path
                                                        d="M444 49.9C431.3 38.2 379.9 .9 265.3 .4c0 0-135.1-8.1-200.9 52.3C27.8 89.3 14.9 143 13.5 209.5c-1.4 66.5-3.1 191.1 117 224.9h.1l-.1 51.6s-.8 20.9 13 25.1c16.6 5.2 26.4-10.7 42.3-27.8 8.7-9.4 20.7-23.2 29.8-33.7 82.2 6.9 145.3-8.9 152.5-11.2 16.6-5.4 110.5-17.4 125.7-142 15.8-128.6-7.6-209.8-49.8-246.5zM457.9 287c-12.9 104-89 110.6-103 115.1-6 1.9-61.5 15.7-131.2 11.2 0 0-52 62.7-68.2 79-5.3 5.3-11.1 4.8-11-5.7 0-6.9 .4-85.7 .4-85.7-.1 0-.1 0 0 0-101.8-28.2-95.8-134.3-94.7-189.8 1.1-55.5 11.6-101 42.6-131.6 55.7-50.5 170.4-43 170.4-43 96.9 .4 143.3 29.6 154.1 39.4 35.7 30.6 53.9 103.8 40.6 211.1zm-139-80.8c.4 8.6-12.5 9.2-12.9 .6-1.1-22-11.4-32.7-32.6-33.9-8.6-.5-7.8-13.4 .7-12.9 27.9 1.5 43.4 17.5 44.8 46.2zm20.3 11.3c1-42.4-25.5-75.6-75.8-79.3-8.5-.6-7.6-13.5 .9-12.9 58 4.2 88.9 44.1 87.8 92.5-.1 8.6-13.1 8.2-12.9-.3zm47 13.4c.1 8.6-12.9 8.7-12.9 .1-.6-81.5-54.9-125.9-120.8-126.4-8.5-.1-8.5-12.9 0-12.9 73.7 .5 133 51.4 133.7 139.2zM374.9 329v.2c-10.8 19-31 40-51.8 33.3l-.2-.3c-21.1-5.9-70.8-31.5-102.2-56.5-16.2-12.8-31-27.9-42.4-42.4-10.3-12.9-20.7-28.2-30.8-46.6-21.3-38.5-26-55.7-26-55.7-6.7-20.8 14.2-41 33.3-51.8h.2c9.2-4.8 18-3.2 23.9 3.9 0 0 12.4 14.8 17.7 22.1 5 6.8 11.7 17.7 15.2 23.8 6.1 10.9 2.3 22-3.7 26.6l-12 9.6c-6.1 4.9-5.3 14-5.3 14s17.8 67.3 84.3 84.3c0 0 9.1 .8 14-5.3l9.6-12c4.6-6 15.7-9.8 26.6-3.7 14.7 8.3 33.4 21.2 45.8 32.9 7 5.7 8.6 14.4 3.8 23.6z"/>
                                                </svg>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="mailto:?body=" target="_blank">
                                                <svg fill="#8338ec" width="48px" height="48px"
                                                     xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
                                                    <path
                                                        d="M48 64C21.5 64 0 85.5 0 112c0 15.1 7.1 29.3 19.2 38.4L236.8 313.6c11.4 8.5 27 8.5 38.4 0L492.8 150.4c12.1-9.1 19.2-23.3 19.2-38.4c0-26.5-21.5-48-48-48H48zM0 176V384c0 35.3 28.7 64 64 64H448c35.3 0 64-28.7 64-64V176L294.4 339.2c-22.8 17.1-54 17.1-76.8 0L0 176z"/>
                                                </svg>
                                            </a>
                                        </li>
                                    </ul>
                                    <div class="copy">
                                        <input type="text" name="text" id="text" value="Loadingg...">
                                        <button>
                                            <svg fill="#8B939A" width="30px" height="100%"
                                                 xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                                <path
                                                    d="M208 0H332.1c12.7 0 24.9 5.1 33.9 14.1l67.9 67.9c9 9 14.1 21.2 14.1 33.9V336c0 26.5-21.5 48-48 48H208c-26.5 0-48-21.5-48-48V48c0-26.5 21.5-48 48-48zM48 128h80v64H64V448H256V416h64v48c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V176c0-26.5 21.5-48 48-48z"/>
                                            </svg>
                                        </button>
                                    </div>
                                    <button class="btn-modal-close">
                                       <i class="fa-regular fa-circle-xmark"></i>
                                    </button>
                                </dialog>
                                <button class="btn-modal" id="modalError">
                                     <i class="fa-solid fa-share-from-square"></i>
                                    <span>Поделиться</span>
                                </button>
                            </li>
                        </ul>
                    </div>
                </div>

                <aside>
                    <div class="advertisement">w</div>

                    <noindex>
                        <div class="saved_calculations">
                            <div class="saved_calculations-header">
                                <svg width="30px" height="30px" xmlns="http://www.w3.org/2000/svg"
                                     viewBox="0 0 448 512">
                                    <path
                                        d="M64 32C28.7 32 0 60.7 0 96V416c0 35.3 28.7 64 64 64H384c35.3 0 64-28.7 64-64V173.3c0-17-6.7-33.3-18.7-45.3L352 50.7C340 38.7 323.7 32 306.7 32H64zm0 96c0-17.7 14.3-32 32-32H288c17.7 0 32 14.3 32 32v64c0 17.7-14.3 32-32 32H96c-17.7 0-32-14.3-32-32V128zM224 288a64 64 0 1 1 0 128 64 64 0 1 1 0-128z"/>
                                </svg>
                                Сохраненные расчеты
                            </div>
                            <ul>
                                <li>
                                    <a href="">
                                        23232332
                                        <button>
                                            X
                                        </button>
                                    </a>
                                </li>
                            </ul>
                        </div>
                    </noindex>
                </aside>
            </div>
        </div>
    </section>
@endsection("endcontent")

@section('scripts')
    @vite(['resources/js/widget.js', 'resources/js/main.js'])
@endsection
